{
    "title": "Hybrid model for Mistswap farm allocation",
    "content": "If this proposal is passed, out of Mist farm rewards, allocate as follows:\n\n30% are allocated, per proposal 00001, to the MIST/BCH pair.\n\n60% are allocated to 30 top pairs by volume (as is today)\n\n10% are allocated to 15 \"holders' choice\" pairs, which are decided in the following way: \n\nAfter each farm adjustment goes into effect, A \"voting season\" is opened immediately, and lasts until the day of the lock-in period for the next adjustment. Each address is provided with an interface that allows delegating available vote weight among any of the active pairs. A voter may weigh his votes differently among the pairs he or she chose. \n\nAt the end of the voting season, the votes for top 15 pairs by total number of votes are used to proportionally divide the 10% of farms rewards to the top 15 voted upon pairs, with a floor set of 0.1% as is done with Volume algorithm (0.25% on Volume algorithm).\n\nIf a pair qualifies for the Volume pool as well as the Holders' Choice, the rewards from both allocation systems are added together. This means, that up to 45 farms could be active in one month, however it is expected for there to be a lot of overlap with farms that are already in list due to meeting the Volume algorithm requirements. \n\nThe monthly votes for \"Holders Choice\" pairs would not be subject to 20% quorum requirement or 1 week GitHub review period.\n\nDue to expected complexity of changes in the governance system required to support this proposal fully, the roll out of this proposal would happen in multiple stages, with Stage 1 below describing the modifications to the above plan to launch with:\n\nFor Stage 1: Use single-choice voting strategy to vote on pairs which are taken from list of BCH/token pairs taken at snapshot time. Snapshot time would be 1 week prior to reweighting, and be available for voting until day of reweighting.\n\nLater stages would use a new multiple-choice voting strategy and ability to vote on pairs at any time (not from a preset snapshot of pairs), as well as starting the voting at the same time of the reweighting lock-in.",
    "strategy": "single-choice",
    "options": [
        "Adopt The Hybrid Allocation Scheme as described above",
        "No, do not create it"
    ],
    "snapshotBlock": "3314032",
    "endBlock": "3361084"
}
